
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2016  Clifford Wolf <clifford@clifford.at>           |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.7 (git sha1 61f6811, gcc 6.2.0-11ubuntu1 -O2 -fdebug-prefix-map=/build/yosys-OIL3SR/yosys-0.7=. -fstack-protector-strong -fPIC -Os)

[TCL: yosys -import] Command name collision: found pre-existing command `cd' -> skip.
[TCL: yosys -import] Command name collision: found pre-existing command `eval' -> skip.
[TCL: yosys -import] Command name collision: found pre-existing command `rename' -> skip.
[TCL: yosys -import] Command name collision: found pre-existing command `trace' -> skip.
echo on

yosys> read_verilog optFIR.v

1. Executing Verilog-2005 frontend.
Parsing Verilog input from `optFIR.v' to AST representation.
Generating RTLIL representation for module `\optFIR_Filter'.
Note: Assuming pure combinatorial block at optFIR.v:35 in
compliance with IEC 62142(E):2005 / IEEE Std. 1364.1(E):2002. Recommending
use of @* instead of @(...) for better match of synthesis and simulation.
Successfully finished Verilog frontend.

yosys> synth -top optFIR_Filter

2. Executing SYNTH pass.

yosys> hierarchy -check -top optFIR_Filter

2.1. Executing HIERARCHY pass (managing design hierarchy).

2.1.1. Analyzing design hierarchy..
Top module:  \optFIR_Filter

2.1.2. Analyzing design hierarchy..
Top module:  \optFIR_Filter
Removed 0 unused modules.

yosys> proc

2.2. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

2.2.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

2.2.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_init

2.2.3. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

2.2.4. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

2.2.5. Executing PROC_MUX pass (convert decision trees to multiplexers).
Creating decoders for process `\optFIR_Filter.$proc$optFIR.v:88$24'.
     1/1: $0\cycle_valid[0:0]
Creating decoders for process `\optFIR_Filter.$proc$optFIR.v:78$21'.
     1/1: $0\phase[2:0]
Creating decoders for process `\optFIR_Filter.$proc$optFIR.v:66$15'.
     1/1: $0\result[15:0]
Creating decoders for process `\optFIR_Filter.$proc$optFIR.v:50$12'.
     1/4: $0\Yt[15:0]
     2/4: $0\X3[15:0]
     3/4: $0\X2[15:0]
     4/4: $0\X1[15:0]
Creating decoders for process `\optFIR_Filter.$proc$optFIR.v:35$7'.
     1/1: $0\samplevalue[15:0]

yosys> proc_dlatch

2.2.6. Executing PROC_DLATCH pass (convert process syncs to latches).
No latch inferred for signal `\optFIR_Filter.\samplevalue' from process `\optFIR_Filter.$proc$optFIR.v:35$7'.

yosys> proc_dff

2.2.7. Executing PROC_DFF pass (convert process syncs to FFs).
Creating register for signal `\optFIR_Filter.\cycle_valid' using process `\optFIR_Filter.$proc$optFIR.v:88$24'.
  created $dff cell `$procdff$85' with positive edge clock.
Creating register for signal `\optFIR_Filter.\phase' using process `\optFIR_Filter.$proc$optFIR.v:78$21'.
  created $dff cell `$procdff$86' with positive edge clock.
Creating register for signal `\optFIR_Filter.\result' using process `\optFIR_Filter.$proc$optFIR.v:66$15'.
  created $dff cell `$procdff$87' with positive edge clock.
Creating register for signal `\optFIR_Filter.\X1' using process `\optFIR_Filter.$proc$optFIR.v:50$12'.
  created $dff cell `$procdff$88' with positive edge clock.
Creating register for signal `\optFIR_Filter.\X2' using process `\optFIR_Filter.$proc$optFIR.v:50$12'.
  created $dff cell `$procdff$89' with positive edge clock.
Creating register for signal `\optFIR_Filter.\X3' using process `\optFIR_Filter.$proc$optFIR.v:50$12'.
  created $dff cell `$procdff$90' with positive edge clock.
Creating register for signal `\optFIR_Filter.\Yt' using process `\optFIR_Filter.$proc$optFIR.v:50$12'.
  created $dff cell `$procdff$91' with positive edge clock.

yosys> proc_clean

2.2.8. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Found and cleaned up 3 empty switches in `\optFIR_Filter.$proc$optFIR.v:88$24'.
Removing empty process `optFIR_Filter.$proc$optFIR.v:88$24'.
Found and cleaned up 2 empty switches in `\optFIR_Filter.$proc$optFIR.v:78$21'.
Removing empty process `optFIR_Filter.$proc$optFIR.v:78$21'.
Found and cleaned up 2 empty switches in `\optFIR_Filter.$proc$optFIR.v:66$15'.
Removing empty process `optFIR_Filter.$proc$optFIR.v:66$15'.
Found and cleaned up 2 empty switches in `\optFIR_Filter.$proc$optFIR.v:50$12'.
Removing empty process `optFIR_Filter.$proc$optFIR.v:50$12'.
Found and cleaned up 4 empty switches in `\optFIR_Filter.$proc$optFIR.v:35$7'.
Removing empty process `optFIR_Filter.$proc$optFIR.v:35$7'.
Cleaned up 13 empty switches.

yosys> opt_expr

2.3. Executing OPT_EXPR pass (perform const folding).
Replacing $eq cell `$eq$optFIR.v:31$1' in module `optFIR_Filter' with $logic_not.
Optimizing away select inverter for $mux cell `$ternary$optFIR.v:32$6' in module `optFIR_Filter'.
Replacing $eq cell `$eq$optFIR.v:37$8' in module `optFIR_Filter' with $logic_not.
Replacing $eq cell `$eq$optFIR.v:51$13' (1) in module `\optFIR_Filter' with constant driver `$eq$optFIR.v:51$13_Y = \rst'.
Replacing $eq cell `$eq$optFIR.v:57$14' (1) in module `\optFIR_Filter' with constant driver `$eq$optFIR.v:57$14_Y = \en'.
Replacing $eq cell `$eq$optFIR.v:67$16' (1) in module `\optFIR_Filter' with constant driver `$eq$optFIR.v:67$16_Y = \rst'.
Replacing $shr cell `$shr$optFIR.v:73$19' (B=4, SHR=4) in module `optFIR_Filter' with fixed wiring: { 4'0000 $mul$optFIR.v:73$18_Y [15:4] }
Replacing $eq cell `$eq$optFIR.v:79$22' (1) in module `\optFIR_Filter' with constant driver `$eq$optFIR.v:79$22_Y = \rst'.
Replacing $eq cell `$eq$optFIR.v:89$25' (1) in module `\optFIR_Filter' with constant driver `$eq$optFIR.v:89$25_Y = \rst'.
Replacing $eq cell `$eq$optFIR.v:91$26' (1) in module `\optFIR_Filter' with constant driver `$eq$optFIR.v:91$26_Y = \en'.
Optimizing away select inverter for $mux cell `$procmux$44' in module `optFIR_Filter'.

yosys> opt_clean

2.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..
  removing unused `$logic_not' cell `$logic_not$optFIR.v:32$5'.
  removing unused `$logic_not' cell `$logic_not$optFIR.v:71$17'.

yosys> check

2.5. Executing CHECK pass (checking for obvious problems).
checking module optFIR_Filter..
found and reported 0 problems.

yosys> opt

2.6. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

2.6.1. Executing OPT_EXPR pass (perform const folding).

yosys> opt_merge -nomux

2.6.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
  Cell `$eq$optFIR.v:37$8' is identical to cell `$eq$optFIR.v:31$1'.
    Redirecting output \Y: $eq$optFIR.v:37$8_Y = $eq$optFIR.v:31$1_Y
    Removing $logic_not cell `$eq$optFIR.v:37$8' from module `\optFIR_Filter'.
  Cell `$eq$optFIR.v:43$11' is identical to cell `$eq$optFIR.v:31$2'.
    Redirecting output \Y: $eq$optFIR.v:43$11_Y = $eq$optFIR.v:31$2_Y
    Removing $eq cell `$eq$optFIR.v:43$11' from module `\optFIR_Filter'.
Removed a total of 2 cells.

yosys> opt_muxtree

2.6.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \optFIR_Filter..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
    Root of a mux tree: $procmux$35 (pure)
    Root of a mux tree: $procmux$41 (pure)
    Root of a mux tree: $procmux$47 (pure)
    Root of a mux tree: $procmux$53 (pure)
    Root of a mux tree: $procmux$59 (pure)
    Root of a mux tree: $procmux$65 (pure)
    Root of a mux tree: $procmux$71 (pure)
    Root of a mux tree: $procmux$83 (pure)
    Root of a mux tree: $ternary$optFIR.v:31$4 (pure)
    Root of a mux tree: $ternary$optFIR.v:32$6 (pure)
  Analyzing evaluation results.
Removed 0 multiplexer ports.

yosys> opt_reduce

2.6.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \optFIR_Filter.
Performed a total of 0 changes.

yosys> opt_merge

2.6.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
Removed a total of 0 cells.

yosys> opt_rmdff

2.6.6. Executing OPT_RMDFF pass (remove dff with constant values).

yosys> opt_clean

2.6.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..

yosys> opt_expr

2.6.8. Executing OPT_EXPR pass (perform const folding).

2.6.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce

2.7. Executing WREDUCE pass (reducing word size of cells).
Removed top 31 bits (of 32) from mux cell optFIR_Filter.$ternary$optFIR.v:31$4 ($mux).
Removed top 1 bits (of 2) from port B of cell optFIR_Filter.$eq$optFIR.v:39$9 ($eq).
Removed top 4 bits (of 16) from port B of cell optFIR_Filter.$add$optFIR.v:73$20 ($add).
Removed top 31 bits (of 32) from port B of cell optFIR_Filter.$add$optFIR.v:84$23 ($add).
Removed top 29 bits (of 32) from port Y of cell optFIR_Filter.$add$optFIR.v:84$23 ($add).
Removed top 29 bits (of 32) from wire optFIR_Filter.$add$optFIR.v:84$23_Y.

yosys> alumacc

2.8. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module optFIR_Filter:
  creating $macc model for $add$optFIR.v:73$20 ($add).
  creating $macc model for $add$optFIR.v:84$23 ($add).
  creating $macc model for $mul$optFIR.v:73$18 ($mul).
  creating $alu model for $macc $add$optFIR.v:84$23.
  creating $alu model for $macc $add$optFIR.v:73$20.
  creating $macc cell for $mul$optFIR.v:73$18: $auto$alumacc.cc:354:replace_macc$93
  creating $alu cell for $add$optFIR.v:73$20: $auto$alumacc.cc:470:replace_alu$94
  creating $alu cell for $add$optFIR.v:84$23: $auto$alumacc.cc:470:replace_alu$97
  created 2 $alu and 1 $macc cells.

yosys> share

2.9. Executing SHARE pass (SAT-based resource sharing).

yosys> opt

2.10. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

2.10.1. Executing OPT_EXPR pass (perform const folding).
Optimizing away select inverter for $mux cell `$ternary$optFIR.v:32$6' in module `optFIR_Filter'.

yosys> opt_merge -nomux

2.10.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
Removed a total of 0 cells.

yosys> opt_muxtree

2.10.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \optFIR_Filter..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
    Root of a mux tree: $procmux$35 (pure)
    Root of a mux tree: $procmux$41 (pure)
    Root of a mux tree: $procmux$47 (pure)
    Root of a mux tree: $procmux$53 (pure)
    Root of a mux tree: $procmux$59 (pure)
    Root of a mux tree: $procmux$65 (pure)
    Root of a mux tree: $procmux$71 (pure)
    Root of a mux tree: $procmux$83 (pure)
    Root of a mux tree: $ternary$optFIR.v:32$6 (pure)
  Analyzing evaluation results.
    dead port 1/2 on $mux $ternary$optFIR.v:31$4.
    dead port 2/2 on $mux $ternary$optFIR.v:31$4.
Removed 2 multiplexer ports.

yosys> opt_reduce

2.10.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \optFIR_Filter.
Performed a total of 0 changes.

yosys> opt_merge

2.10.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
Removed a total of 0 cells.

yosys> opt_rmdff

2.10.6. Executing OPT_RMDFF pass (remove dff with constant values).

yosys> opt_clean

2.10.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..
  removing unused non-port wire \muxsel.
  removed 1 unused temporary wires.

yosys> opt_expr

2.10.8. Executing OPT_EXPR pass (perform const folding).

2.10.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

2.10.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \optFIR_Filter..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
    Root of a mux tree: $procmux$35 (pure)
    Root of a mux tree: $procmux$41 (pure)
    Root of a mux tree: $procmux$47 (pure)
    Root of a mux tree: $procmux$53 (pure)
    Root of a mux tree: $procmux$59 (pure)
    Root of a mux tree: $procmux$65 (pure)
    Root of a mux tree: $procmux$71 (pure)
    Root of a mux tree: $procmux$83 (pure)
    Root of a mux tree: $ternary$optFIR.v:32$6 (pure)
  Analyzing evaluation results.
Removed 0 multiplexer ports.

yosys> opt_reduce

2.10.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \optFIR_Filter.
Performed a total of 0 changes.

yosys> opt_merge

2.10.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
Removed a total of 0 cells.

yosys> opt_rmdff

2.10.13. Executing OPT_RMDFF pass (remove dff with constant values).

yosys> opt_clean

2.10.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..

yosys> opt_expr

2.10.15. Executing OPT_EXPR pass (perform const folding).

2.10.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

2.11. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

2.11.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

2.11.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

2.11.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

2.11.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..

yosys> fsm_opt

2.11.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode

2.11.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

2.11.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

2.11.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -fast

2.12. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

2.12.1. Executing OPT_EXPR pass (perform const folding).

yosys> opt_merge

2.12.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
Removed a total of 0 cells.

yosys> opt_rmdff

2.12.3. Executing OPT_RMDFF pass (remove dff with constant values).

yosys> opt_clean

2.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..

2.12.5. Finished fast OPT passes.

yosys> memory -nomap

2.13. Executing MEMORY pass.

yosys> memory_dff

2.13.1. Executing MEMORY_DFF pass (merging $dff cells to $memrd and $memwr).

yosys> opt_clean

2.13.2. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..

yosys> memory_share

2.13.3. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_clean

2.13.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..

yosys> memory_collect

2.13.5. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

2.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..

yosys> opt -fast -full

2.15. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

2.15.1. Executing OPT_EXPR pass (perform const folding).
Replacing $mux cell `$procmux$32' in module `optFIR_Filter' with or-gate.

yosys> opt_merge

2.15.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
Removed a total of 0 cells.

yosys> opt_rmdff

2.15.3. Executing OPT_RMDFF pass (remove dff with constant values).

yosys> opt_clean

2.15.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..

2.15.5. Finished fast OPT passes.

yosys> memory_map

2.16. Executing MEMORY_MAP pass (converting $mem cells to logic and flip-flops).

yosys> opt -full

2.17. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

2.17.1. Executing OPT_EXPR pass (perform const folding).

yosys> opt_merge -nomux

2.17.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
Removed a total of 0 cells.

yosys> opt_muxtree

2.17.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \optFIR_Filter..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
    Root of a mux tree: $procmux$29 (pure)
    Root of a mux tree: $procmux$35 (pure)
    Root of a mux tree: $procmux$41 (pure)
    Root of a mux tree: $procmux$47 (pure)
    Root of a mux tree: $procmux$53 (pure)
    Root of a mux tree: $procmux$59 (pure)
    Root of a mux tree: $procmux$65 (pure)
    Root of a mux tree: $procmux$71 (pure)
    Root of a mux tree: $procmux$83 (pure)
    Root of a mux tree: $ternary$optFIR.v:32$6 (pure)
  Analyzing evaluation results.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

2.17.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \optFIR_Filter.
Performed a total of 0 changes.

yosys> opt_merge

2.17.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
Removed a total of 0 cells.

yosys> opt_rmdff

2.17.6. Executing OPT_RMDFF pass (remove dff with constant values).

yosys> opt_clean

2.17.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..

yosys> opt_expr -full

2.17.8. Executing OPT_EXPR pass (perform const folding).

2.17.9. Finished OPT passes. (There is nothing left to do.)

yosys> techmap

2.18. Executing TECHMAP pass (map to technology primitives).

2.18.1. Executing Verilog-2005 frontend.
Parsing Verilog input from `<techmap.v>' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.
Mapping optFIR_Filter.$eq$optFIR.v:31$1 ($logic_not) with simplemap.
Mapping optFIR_Filter.$eq$optFIR.v:31$2 ($eq) with simplemap.
Mapping optFIR_Filter.$logic_or$optFIR.v:31$3 ($logic_or) with simplemap.

2.18.2. Executing AST frontend in derive mode using pre-parsed AST for module `\_90_alu'.
Parameter \A_SIGNED = 0
Parameter \B_SIGNED = 0
Parameter \A_WIDTH = 12
Parameter \B_WIDTH = 16
Parameter \Y_WIDTH = 16
Generating RTLIL representation for module `$paramod\_90_alu\A_SIGNED=0\B_SIGNED=0\A_WIDTH=12\B_WIDTH=16\Y_WIDTH=16'.

2.18.3. Continuing TECHMAP pass.
Mapping optFIR_Filter.$auto$alumacc.cc:470:replace_alu$94 using $paramod\_90_alu\A_SIGNED=0\B_SIGNED=0\A_WIDTH=12\B_WIDTH=16\Y_WIDTH=16.
Mapping optFIR_Filter.$ternary$optFIR.v:32$6 ($mux) with simplemap.
Mapping optFIR_Filter.$eq$optFIR.v:39$9 ($eq) with simplemap.
Mapping optFIR_Filter.$eq$optFIR.v:41$10 ($eq) with simplemap.
Mapping optFIR_Filter.$auto$alumacc.cc:354:replace_macc$93 ($macc) with maccmap.
  add \samplevalue * \coeff (16x16 bits, unsigned)
Mapping optFIR_Filter.$eq$optFIR.v:93$27 ($eq) with simplemap.
Mapping optFIR_Filter.$procmux$29 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$32 ($or) with simplemap.
Mapping optFIR_Filter.$procmux$35 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$38 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$41 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$44 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$47 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$50 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$53 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$56 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$59 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$62 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$65 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$68 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$71 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$74 ($mux) with simplemap.

2.18.4. Executing AST frontend in derive mode using pre-parsed AST for module `\_90_alu'.
Parameter \A_SIGNED = 0
Parameter \B_SIGNED = 0
Parameter \A_WIDTH = 1
Parameter \B_WIDTH = 3
Parameter \Y_WIDTH = 3
Generating RTLIL representation for module `$paramod\_90_alu\A_SIGNED=0\B_SIGNED=0\A_WIDTH=1\B_WIDTH=3\Y_WIDTH=3'.

2.18.5. Continuing TECHMAP pass.
Mapping optFIR_Filter.$auto$alumacc.cc:470:replace_alu$97 using $paramod\_90_alu\A_SIGNED=0\B_SIGNED=0\A_WIDTH=1\B_WIDTH=3\Y_WIDTH=3.
Mapping optFIR_Filter.$procmux$77 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$80 ($mux) with simplemap.
Mapping optFIR_Filter.$procmux$83 ($mux) with simplemap.
Mapping optFIR_Filter.$procdff$85 ($dff) with simplemap.
Mapping optFIR_Filter.$procdff$86 ($dff) with simplemap.
Mapping optFIR_Filter.$procdff$87 ($dff) with simplemap.
Mapping optFIR_Filter.$procdff$88 ($dff) with simplemap.
Mapping optFIR_Filter.$procdff$89 ($dff) with simplemap.
Mapping optFIR_Filter.$procdff$90 ($dff) with simplemap.
Mapping optFIR_Filter.$procdff$91 ($dff) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.$xor$<techmap.v>:262$166 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.$xor$<techmap.v>:263$167 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.$and$<techmap.v>:260$165 ($and) with simplemap.

2.18.6. Executing AST frontend in derive mode using pre-parsed AST for module `\_90_lcu'.
Parameter \WIDTH = 16
Generating RTLIL representation for module `$paramod\_90_lcu\WIDTH=16'.

yosys [$paramod\_90_lcu\WIDTH=16]> proc

2.18.7. Executing PROC pass (convert processes to netlists).

yosys [$paramod\_90_lcu\WIDTH=16]> proc_clean

2.18.7.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys [$paramod\_90_lcu\WIDTH=16]> proc_rmdead

2.18.7.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys [$paramod\_90_lcu\WIDTH=16]> proc_init

2.18.7.3. Executing PROC_INIT pass (extract init attributes).

yosys [$paramod\_90_lcu\WIDTH=16]> proc_arst

2.18.7.4. Executing PROC_ARST pass (detect async resets in processes).

yosys [$paramod\_90_lcu\WIDTH=16]> proc_mux

2.18.7.5. Executing PROC_MUX pass (convert decision trees to multiplexers).
Creating decoders for process `$paramod\_90_lcu\WIDTH=16.$proc$<techmap.v>:207$706'.
     1/32: $0\p[15:0] [14]
     2/32: $0\g[15:0] [14]
     3/32: $0\p[15:0] [12]
     4/32: $0\g[15:0] [12]
     5/32: $0\p[15:0] [10]
     6/32: $0\g[15:0] [10]
     7/32: $0\p[15:0] [8]
     8/32: $0\g[15:0] [8]
     9/32: $0\p[15:0] [6]
    10/32: $0\g[15:0] [6]
    11/32: $0\p[15:0] [4]
    12/32: $0\g[15:0] [4]
    13/32: $0\p[15:0] [2]
    14/32: $0\g[15:0] [2]
    15/32: $0\p[15:0] [13]
    16/32: $0\g[15:0] [13]
    17/32: $0\p[15:0] [9]
    18/32: $0\g[15:0] [9]
    19/32: $0\p[15:0] [5]
    20/32: $0\g[15:0] [5]
    21/32: $0\p[15:0] [11]
    22/32: $0\g[15:0] [11]
    23/32: $0\p[15:0] [15]
    24/32: $0\g[15:0] [15]
    25/32: $0\p[15:0] [7]
    26/32: $0\g[15:0] [7]
    27/32: $0\p[15:0] [3]
    28/32: $0\g[15:0] [3]
    29/32: $0\p[15:0] [1]
    30/32: $0\g[15:0] [1]
    31/32: $0\g[15:0] [0]
    32/32: $0\p[15:0] [0]

yosys [$paramod\_90_lcu\WIDTH=16]> proc_dlatch

2.18.7.6. Executing PROC_DLATCH pass (convert process syncs to latches).
No latch inferred for signal `$paramod\_90_lcu\WIDTH=16.\g' from process `$paramod\_90_lcu\WIDTH=16.$proc$<techmap.v>:207$706'.
No latch inferred for signal `$paramod\_90_lcu\WIDTH=16.\p' from process `$paramod\_90_lcu\WIDTH=16.$proc$<techmap.v>:207$706'.

yosys [$paramod\_90_lcu\WIDTH=16]> proc_dff

2.18.7.7. Executing PROC_DFF pass (convert process syncs to FFs).

yosys [$paramod\_90_lcu\WIDTH=16]> proc_clean

2.18.7.8. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Removing empty process `$paramod\_90_lcu\WIDTH=16.$proc$<techmap.v>:207$706'.
Cleaned up 0 empty switches.

yosys [$paramod\_90_lcu\WIDTH=16]> opt -fast

2.18.8. Executing OPT pass (performing simple optimizations).

yosys [$paramod\_90_lcu\WIDTH=16]> opt_expr

2.18.8.1. Executing OPT_EXPR pass (perform const folding).

yosys [$paramod\_90_lcu\WIDTH=16]> opt_merge

2.18.8.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `$paramod\_90_lcu\WIDTH=16'.
Removed a total of 0 cells.

yosys [$paramod\_90_lcu\WIDTH=16]> opt_rmdff

2.18.8.3. Executing OPT_RMDFF pass (remove dff with constant values).

yosys [$paramod\_90_lcu\WIDTH=16]> opt_clean

2.18.8.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module $paramod\_90_lcu\WIDTH=16..
  removing unused `$and' cell `$and$<techmap.v>:222$711'.
  removing unused `$and' cell `$and$<techmap.v>:222$735'.
  removing unused `$and' cell `$and$<techmap.v>:222$747'.
  removing unused `$and' cell `$and$<techmap.v>:222$753'.
  removing unused `$and' cell `$and$<techmap.v>:230$756'.
  removing unused `$and' cell `$and$<techmap.v>:230$759'.
  removing unused `$and' cell `$and$<techmap.v>:230$762'.
  removing unused `$and' cell `$and$<techmap.v>:230$765'.
  removing unused `$and' cell `$and$<techmap.v>:230$768'.
  removing unused `$and' cell `$and$<techmap.v>:230$771'.
  removing unused `$and' cell `$and$<techmap.v>:230$774'.
  removing unused `$and' cell `$and$<techmap.v>:230$777'.
  removing unused `$and' cell `$and$<techmap.v>:230$780'.
  removing unused `$and' cell `$and$<techmap.v>:230$783'.
  removing unused `$and' cell `$and$<techmap.v>:230$786'.
  removing unused non-port wire \j.
  removing unused non-port wire \i.
  removed 2 unused temporary wires.

2.18.8.5. Finished fast OPT passes.

2.18.9. Continuing TECHMAP pass.
Mapping optFIR_Filter.$auto$alumacc.cc:470:replace_alu$94.lcu using $paramod\_90_lcu\WIDTH=16.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164 ($mux) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.$not$<techmap.v>:258$163 ($not) with simplemap.
Mapping optFIR_Filter.$auto$alumacc.cc:470:replace_alu$94.B_conv ($pos) with simplemap.
Mapping optFIR_Filter.$auto$alumacc.cc:470:replace_alu$94.A_conv ($pos) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$210 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$212 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$214 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$216 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$218 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$220 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$222 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$224 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$226 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$228 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$230 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$232 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$234 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$236 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$238 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:82:add$240 ($and) with simplemap.

2.18.10. Executing AST frontend in derive mode using pre-parsed AST for module `\_90_fa'.
Parameter \WIDTH = 16
Generating RTLIL representation for module `$paramod\_90_fa\WIDTH=16'.

2.18.11. Continuing TECHMAP pass.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$244 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$247 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$250 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$253 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$256 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$259 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$262 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$265 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$268 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$271 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$274 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$277 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$280 using $paramod\_90_fa\WIDTH=16.
Mapping optFIR_Filter.$auto$maccmap.cc:114:fulladd$283 using $paramod\_90_fa\WIDTH=16.

2.18.12. Executing AST frontend in derive mode using pre-parsed AST for module `\_90_alu'.
Parameter \A_SIGNED = 0
Parameter \B_SIGNED = 0
Parameter \A_WIDTH = 16
Parameter \B_WIDTH = 16
Parameter \Y_WIDTH = 16
Generating RTLIL representation for module `$paramod\_90_alu\A_SIGNED=0\B_SIGNED=0\A_WIDTH=16\B_WIDTH=16\Y_WIDTH=16'.

2.18.13. Continuing TECHMAP pass.
Mapping optFIR_Filter.$auto$maccmap.cc:240:synth$284 using $paramod\_90_alu\A_SIGNED=0\B_SIGNED=0\A_WIDTH=16\B_WIDTH=16\Y_WIDTH=16.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$97.$xor$<techmap.v>:262$489 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$97.$xor$<techmap.v>:263$490 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$97.$and$<techmap.v>:260$488 ($and) with simplemap.

2.18.14. Executing AST frontend in derive mode using pre-parsed AST for module `\_90_lcu'.
Parameter \WIDTH = 3
Generating RTLIL representation for module `$paramod\_90_lcu\WIDTH=3'.

yosys [$paramod\_90_lcu\WIDTH=3]> proc

2.18.15. Executing PROC pass (convert processes to netlists).

yosys [$paramod\_90_lcu\WIDTH=3]> proc_clean

2.18.15.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys [$paramod\_90_lcu\WIDTH=3]> proc_rmdead

2.18.15.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys [$paramod\_90_lcu\WIDTH=3]> proc_init

2.18.15.3. Executing PROC_INIT pass (extract init attributes).

yosys [$paramod\_90_lcu\WIDTH=3]> proc_arst

2.18.15.4. Executing PROC_ARST pass (detect async resets in processes).

yosys [$paramod\_90_lcu\WIDTH=3]> proc_mux

2.18.15.5. Executing PROC_MUX pass (convert decision trees to multiplexers).
Creating decoders for process `$paramod\_90_lcu\WIDTH=3.$proc$<techmap.v>:207$1101'.
     1/6: $0\p[2:0] [2]
     2/6: $0\g[2:0] [2]
     3/6: $0\p[2:0] [1]
     4/6: $0\g[2:0] [1]
     5/6: $0\g[2:0] [0]
     6/6: $0\p[2:0] [0]

yosys [$paramod\_90_lcu\WIDTH=3]> proc_dlatch

2.18.15.6. Executing PROC_DLATCH pass (convert process syncs to latches).
No latch inferred for signal `$paramod\_90_lcu\WIDTH=3.\g' from process `$paramod\_90_lcu\WIDTH=3.$proc$<techmap.v>:207$1101'.
No latch inferred for signal `$paramod\_90_lcu\WIDTH=3.\p' from process `$paramod\_90_lcu\WIDTH=3.$proc$<techmap.v>:207$1101'.

yosys [$paramod\_90_lcu\WIDTH=3]> proc_dff

2.18.15.7. Executing PROC_DFF pass (convert process syncs to FFs).

yosys [$paramod\_90_lcu\WIDTH=3]> proc_clean

2.18.15.8. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Removing empty process `$paramod\_90_lcu\WIDTH=3.$proc$<techmap.v>:207$1101'.
Cleaned up 0 empty switches.

yosys [$paramod\_90_lcu\WIDTH=3]> opt -fast

2.18.16. Executing OPT pass (performing simple optimizations).

yosys [$paramod\_90_lcu\WIDTH=3]> opt_expr

2.18.16.1. Executing OPT_EXPR pass (perform const folding).

yosys [$paramod\_90_lcu\WIDTH=3]> opt_merge

2.18.16.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `$paramod\_90_lcu\WIDTH=3'.
Removed a total of 0 cells.

yosys [$paramod\_90_lcu\WIDTH=3]> opt_rmdff

2.18.16.3. Executing OPT_RMDFF pass (remove dff with constant values).

yosys [$paramod\_90_lcu\WIDTH=3]> opt_clean

2.18.16.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module $paramod\_90_lcu\WIDTH=3..
  removing unused `$and' cell `$and$<techmap.v>:222$1106'.
  removing unused `$and' cell `$and$<techmap.v>:230$1109'.
  removing unused non-port wire \j.
  removing unused non-port wire \i.
  removed 2 unused temporary wires.

2.18.16.5. Finished fast OPT passes.

2.18.17. Continuing TECHMAP pass.
Mapping optFIR_Filter.$auto$alumacc.cc:470:replace_alu$97.lcu using $paramod\_90_lcu\WIDTH=3.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$97.$ternary$<techmap.v>:258$487 ($mux) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$97.$not$<techmap.v>:258$486 ($not) with simplemap.
Mapping optFIR_Filter.$auto$alumacc.cc:470:replace_alu$97.B_conv ($pos) with simplemap.
Mapping optFIR_Filter.$auto$alumacc.cc:470:replace_alu$97.A_conv ($pos) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:222$750 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:222$744 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:222$741 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:222$738 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:222$732 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:222$729 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:222$726 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:222$723 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:222$720 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:222$717 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:222$714 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$751 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$748 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$745 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$742 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$739 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$736 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$733 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$730 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$727 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$724 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$721 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$718 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$715 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$712 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$709 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:212$707 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$97.lcu.$or$<techmap.v>:229$1108 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$97.lcu.$or$<techmap.v>:221$1105 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$97.lcu.$or$<techmap.v>:212$1103 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$97.lcu.$and$<techmap.v>:229$1107 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$97.lcu.$and$<techmap.v>:221$1104 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$97.lcu.$and$<techmap.v>:212$1102 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$754 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$757 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$760 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$763 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$766 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$769 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$772 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$775 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$778 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$781 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$784 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:212$708 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$710 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$713 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$716 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$719 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$722 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$725 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$728 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$731 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$734 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$737 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$740 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$743 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$746 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$749 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$752 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:229$755 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:229$758 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:229$761 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:229$764 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:229$767 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:229$770 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:229$773 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:229$776 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:229$779 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:229$782 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:229$785 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$244.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$244.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$244.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$247.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$247.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$247.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$250.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$253.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$259.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$259.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$259.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$262.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$268.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$268.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$268.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$274.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$280.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:263$1084 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:262$1083 ($xor) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.$and$<techmap.v>:260$1082 ($and) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:240:synth$284.lcu using $paramod\_90_lcu\WIDTH=16.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081 ($mux) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.$not$<techmap.v>:258$1080 ($not) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:240:synth$284.B_conv ($pos) with simplemap.
Mapping optFIR_Filter.$auto$maccmap.cc:240:synth$284.A_conv ($pos) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:212$707 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$709 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$712 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$715 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$718 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$721 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$724 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$727 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$730 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$733 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$736 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$739 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$742 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$745 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$748 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$751 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:222$714 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:222$717 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:222$720 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:222$723 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:222$726 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:222$729 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:222$732 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:222$738 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:222$741 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:222$744 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:222$750 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$754 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$757 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$760 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$763 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$766 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$769 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$772 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$775 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$778 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$781 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$784 ($and) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:212$708 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$710 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$713 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$716 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$719 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$722 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$725 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$728 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$731 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$734 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$737 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$740 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$743 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$746 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$749 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$752 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:229$755 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:229$758 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:229$761 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:229$764 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:229$767 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:229$770 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:229$773 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:229$776 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:229$779 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:229$782 ($or) with simplemap.
Mapping optFIR_Filter.$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:229$785 ($or) with simplemap.
No more expansions possible.

yosys> opt -fast

2.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

2.19.1. Executing OPT_EXPR pass (perform const folding).
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$788' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [1] = \result [1]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$153' (?0) in module `\optFIR_Filter' with constant driver `$auto$simplemap.cc:250:simplemap_eqne$149 [2] = \phase [2]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1063' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1046' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1014' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$235 [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1030' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1574' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1542' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1558' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [3] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1510' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1045' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1013' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$235 [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1029' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1573' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1525' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$996' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$233 [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$964' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$229 [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$980' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$231 [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1492' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1460' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1476' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1428' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$997' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$233 [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$965' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$229 [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$981' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$231 [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1493' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1445' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:190$1078_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1813' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1781' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1797' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1749' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$948' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$227 [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$916' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$223 [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$932' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$225 [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1412' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:189$1075_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1380' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1396' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1348' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$900' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$221 [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$868' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$217 [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$884' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$219 [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1332' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$xor$<techmap.v>:189$1075_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1300' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1316' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1268' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$949' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$227 [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$917' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$223 [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$933' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$225 [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1413' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:189$1075_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1365' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:190$1078_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1733' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:189$1075_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1701' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1717' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1669' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$or$<techmap.v>:190$1079_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1526' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1461' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1477' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1076_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1429' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$or$<techmap.v>:190$1079_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$998' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$233 [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$966' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$229 [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$982' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$231 [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1494' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1446' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:190$1078_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1814' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1766' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1974' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1942' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1958' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [3] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1910' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2135' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2103' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2119' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [4] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2071' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2087' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1926' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1685' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:190$1078_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1284' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$xor$<techmap.v>:190$1078_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$851' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$215 [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$188' (?0) in module `\optFIR_Filter' with constant driver `$auto$simplemap.cc:250:simplemap_eqne$184 [2] = \phase [2]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$187' (?0) in module `\optFIR_Filter' with constant driver `$auto$simplemap.cc:250:simplemap_eqne$184 [1] = \phase [1]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$201' (?0) in module `\optFIR_Filter' with constant driver `$auto$simplemap.cc:250:simplemap_eqne$197 [2] = \phase [2]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$199' (?0) in module `\optFIR_Filter' with constant driver `$auto$simplemap.cc:250:simplemap_eqne$197 [0] = \phase [0]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$470' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$491' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$507' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$523' in module `optFIR_Filter'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$835' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$213 [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1251' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1219' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$244.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1235' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$244.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1187' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$244.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$852' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$215 [1] = 1'0'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$471' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$492' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$508' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$524' in module `optFIR_Filter'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1204' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:190$1078_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1652' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1620' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1636' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1588' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$901' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$221 [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$869' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$217 [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$885' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$219 [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1333' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$xor$<techmap.v>:189$1075_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1285' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$xor$<techmap.v>:190$1078_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1220' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$244.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1188' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$244.$or$<techmap.v>:190$1079_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$and$<techmap.v>:189$1076_Y [1]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$472' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$493' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$509' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$525' in module `optFIR_Filter'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1605' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:190$1078_Y [2] = $techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [2]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1893' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [2] = $techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [2]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1861' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1877' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$and$<techmap.v>:189$1076_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1829' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$or$<techmap.v>:190$1079_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1381' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1397' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1076_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1349' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$or$<techmap.v>:190$1079_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1301' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1317' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1076_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1269' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$or$<techmap.v>:190$1079_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$950' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$227 [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$918' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$223 [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$934' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$225 [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1414' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:189$1075_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1366' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:190$1078_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1734' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:189$1075_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1686' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:190$1078_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1621' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1589' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$or$<techmap.v>:190$1079_Y [2] = $techmap$auto$maccmap.cc:114:fulladd$259.$and$<techmap.v>:189$1076_Y [2]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$902' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$221 [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$886' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$219 [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1334' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$xor$<techmap.v>:189$1075_Y [3] = $auto$rtlil.cc:1629:And$217 [3]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1286' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$xor$<techmap.v>:190$1078_Y [3] = $auto$rtlil.cc:1629:And$217 [3]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$473' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$494' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$510' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$526' in module `optFIR_Filter'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1846' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:190$1078_Y [3] = $techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [3]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2054' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [3] = $techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [3]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2022' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1077_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2038' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1076_Y [3] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1990' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$or$<techmap.v>:190$1079_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1782' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1798' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076_Y [3] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1750' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1702' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1077_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1718' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076_Y [3] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1670' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$or$<techmap.v>:190$1079_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1047' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1015' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$235 [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1031' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1575' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1527' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1462' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1077_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1478' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1076_Y [3] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1430' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$or$<techmap.v>:190$1079_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$999' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$233 [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$967' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$229 [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$983' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$231 [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1495' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1447' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:190$1078_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1815' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1767' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1975' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1927' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1862' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$and$<techmap.v>:189$1077_Y [3] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1830' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$or$<techmap.v>:190$1079_Y [3] = $techmap$auto$maccmap.cc:114:fulladd$268.$and$<techmap.v>:189$1076_Y [3]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1382' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1077_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1398' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1076_Y [3] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1350' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$or$<techmap.v>:190$1079_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1302' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1077_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1318' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1076_Y [3] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1270' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$or$<techmap.v>:190$1079_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$951' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$227 [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$919' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$223 [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$935' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$225 [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1415' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:189$1075_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1367' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:190$1078_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1735' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:189$1075_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1687' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:190$1078_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$903' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$221 [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1287' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$xor$<techmap.v>:190$1078_Y [4] = $techmap$auto$maccmap.cc:114:fulladd$247.$xor$<techmap.v>:189$1075_Y [4]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$474' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$495' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$511' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$527' in module `optFIR_Filter'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1847' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:190$1078_Y [4] = $techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [4]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2007' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:190$1078_Y [4] = $techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [4]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2215' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [4] = $techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [4]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2183' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1077_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2199' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1076_Y [4] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2151' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$or$<techmap.v>:190$1079_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1064' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1543' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1559' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [4] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1511' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1943' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1959' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [4] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1911' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2136' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2088' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2023' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1077_Y [4] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1991' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$or$<techmap.v>:190$1079_Y [4] = $techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1076_Y [4]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1783' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1799' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076_Y [4] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1751' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1703' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1077_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1719' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076_Y [4] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1671' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$or$<techmap.v>:190$1079_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1048' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1016' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$235 [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1032' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1576' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1528' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1463' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1077_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1479' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1076_Y [4] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1431' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$or$<techmap.v>:190$1079_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1000' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$233 [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$968' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$229 [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$984' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$231 [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1496' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1448' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:190$1078_Y [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1816' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075_Y [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1768' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078_Y [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1976' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075_Y [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1928' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1863' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$and$<techmap.v>:189$1077_Y [4] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1831' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$or$<techmap.v>:190$1079_Y [4] = $techmap$auto$maccmap.cc:114:fulladd$268.$and$<techmap.v>:189$1076_Y [4]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1383' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1077_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1399' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1076_Y [4] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1351' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$or$<techmap.v>:190$1079_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1303' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1077_Y [4] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1271' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$or$<techmap.v>:190$1079_Y [4] = $techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1076_Y [4]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$952' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$227 [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$920' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$223 [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$936' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$225 [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1416' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:189$1075_Y [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1368' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:190$1078_Y [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1736' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:189$1075_Y [5] = $techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1076_Y [4]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1688' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:190$1078_Y [5] = $techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1076_Y [4]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$475' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$496' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$512' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$528' in module `optFIR_Filter'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2008' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:190$1078_Y [5] = $techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [5]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2168' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:190$1078_Y [5] = $techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [5]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2296' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [5] = $techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [5]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2248' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [5] = $techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [5]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1062' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1541' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1557' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1509' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1044' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1012' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$235 [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1028' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1572' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1524' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$995' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$233 [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$963' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$229 [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$979' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$231 [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1491' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1459' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1475' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1427' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1444' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:190$1078_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1812' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1780' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1796' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1748' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$947' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$227 [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$915' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$223 [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$931' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$225 [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1411' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:189$1075_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1379' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1395' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1347' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$899' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$221 [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$867' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$217 [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$883' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$219 [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1331' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$xor$<techmap.v>:189$1075_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1299' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1315' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1267' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1364' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:190$1078_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1732' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:189$1075_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1700' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1716' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1668' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1765' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1973' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1941' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1957' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1909' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2134' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2102' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2118' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [3] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2070' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2086' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1925' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1684' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:190$1078_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1283' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$247.$xor$<techmap.v>:190$1078_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1203' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:190$1078_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1651' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1619' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1635' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1587' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1604' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:190$1078_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1892' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1860' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1876' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1828' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1845' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:190$1078_Y [2] = $techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [2]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2053' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [2] = $techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [2]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2021' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2037' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1076_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1989' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$or$<techmap.v>:190$1079_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2006' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:190$1078_Y [3] = $techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [3]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2214' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [3] = $techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [3]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2182' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1077_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2198' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1076_Y [3] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2150' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$or$<techmap.v>:190$1079_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2167' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:190$1078_Y [4] = $techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [4]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2295' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [4] = $techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [4]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2263' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2279' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [4] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2231' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [4] = 1'0'.
Replacing $_NOT_ cell `$auto$simplemap.cc:37:simplemap_not$2377' (0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$not$<techmap.v>:258$1080_Y [5] = 1'1'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2361' (010) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2329' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:262$1083_Y [5] = $techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [5]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2247' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [4] = $techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [4]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1061' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1540' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1556' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1508' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1043' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1011' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$235 [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1027' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1571' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1523' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1443' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:190$1078_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1811' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1779' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1795' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1747' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1363' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:190$1078_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1731' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:189$1075_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1699' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1715' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1667' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1764' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1972' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1940' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1956' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1908' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2133' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2101' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2117' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2069' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2085' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1924' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1683' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:190$1078_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1603' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:190$1078_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1891' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1859' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1875' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1827' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1844' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:190$1078_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2052' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2020' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2036' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1988' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2005' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:190$1078_Y [2] = $techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [2]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2213' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [2] = $techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [2]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2181' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2197' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1076_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2149' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$or$<techmap.v>:190$1079_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2166' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:190$1078_Y [3] = $techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [3]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2294' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [3] = $techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [3]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2262' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2278' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [3] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2230' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [3] = 1'0'.
Replacing $_NOT_ cell `$auto$simplemap.cc:37:simplemap_not$2376' (0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$not$<techmap.v>:258$1080_Y [4] = 1'1'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2360' (010) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [4] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2344' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$and$<techmap.v>:260$1082_Y [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2328' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:262$1083_Y [4] = $techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [4]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1060' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1539' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1555' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1507' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1763' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1971' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1939' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1955' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1907' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2132' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2100' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2116' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2068' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2084' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1923' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1843' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:190$1078_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2051' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2019' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2035' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1987' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2004' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:190$1078_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2212' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2180' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2196' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2148' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2165' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:190$1078_Y [2] = $techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [2]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2293' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [2] = $techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [2]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2245' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [2] = $techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [2]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1059' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2131' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2099' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2115' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2067' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2083' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2003' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:190$1078_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2211' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2179' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2195' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2147' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2164' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:190$1078_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2292' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2260' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2276' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2228' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [1] = 1'0'.
Replacing $_NOT_ cell `$auto$simplemap.cc:37:simplemap_not$2374' (0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$not$<techmap.v>:258$1080_Y [2] = 1'1'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2358' (010) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2326' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:262$1083_Y [2] = $techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [2]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2246' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [3] = $techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [3]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2261' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2277' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2229' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [2] = 1'0'.
Replacing $_NOT_ cell `$auto$simplemap.cc:37:simplemap_not$2375' (0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$not$<techmap.v>:258$1080_Y [3] = 1'1'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2359' (010) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [3] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2327' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:262$1083_Y [3] = $techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [3]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2244' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2163' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:190$1078_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2291' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2259' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2275' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [0] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2227' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [0] = 1'0'.
Replacing $_NOT_ cell `$auto$simplemap.cc:37:simplemap_not$2373' (0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$not$<techmap.v>:258$1080_Y [1] = 1'1'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2357' (010) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2341' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$and$<techmap.v>:260$1082_Y [1] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2325' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:262$1083_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2243' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_NOT_ cell `$auto$simplemap.cc:37:simplemap_not$2372' (0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$not$<techmap.v>:258$1080_Y [0] = 1'1'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2356' (010) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2340' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$and$<techmap.v>:260$1082_Y [0] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2324' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:262$1083_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2388' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:212$707_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2426' (00) in module `\optFIR_Filter' with constant driver `$auto$maccmap.cc:247:synth$287 [0] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2389' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$709_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2427' (00) in module `\optFIR_Filter' with constant driver `$auto$maccmap.cc:247:synth$287 [1] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2397' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$733_Y = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2343' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$and$<techmap.v>:260$1082_Y [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2342' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$and$<techmap.v>:260$1082_Y [2] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2390' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$712_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2428' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$713_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2435' (00) in module `\optFIR_Filter' with constant driver `$auto$maccmap.cc:247:synth$287 [3] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2420' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$769_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2447' (00) in module `\optFIR_Filter' with constant driver `$auto$maccmap.cc:247:synth$287 [4] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2312' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:263$1084_Y [5] = $techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [5]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$787' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [0] = \result [0]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$789' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [2] = \result [2]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$790' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [3] = \result [3]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2311' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:263$1084_Y [4] = $techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [4]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1142' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:212$707_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1160' (?0) in module `\optFIR_Filter' with constant driver `$auto$alumacc.cc:484:replace_alu$96 [0] = $techmap$auto$alumacc.cc:470:replace_alu$94.$and$<techmap.v>:260$165_Y [0]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1065' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1544' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1560' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [5] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1512' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1944' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1960' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [5] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1912' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [5] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2137' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2105' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2121' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [6] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2073' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2089' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2024' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1077_Y [5] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1992' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$or$<techmap.v>:190$1079_Y [5] = $techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1076_Y [5]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1784' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1800' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076_Y [5] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1752' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1704' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1077_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1720' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076_Y [5] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1672' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$or$<techmap.v>:190$1079_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1049' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1017' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$235 [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1033' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1577' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1529' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1464' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1077_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1480' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1076_Y [5] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1432' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$or$<techmap.v>:190$1079_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1001' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$233 [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$969' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$229 [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$985' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$231 [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1497' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1449' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:190$1078_Y [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1817' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075_Y [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1769' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078_Y [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1977' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075_Y [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1929' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1384' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1077_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1400' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1076_Y [5] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1352' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$or$<techmap.v>:190$1079_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$953' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$227 [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$937' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$225 [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1417' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:189$1075_Y [6] = $auto$rtlil.cc:1629:And$223 [6]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1369' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:190$1078_Y [6] = $auto$rtlil.cc:1629:And$223 [6]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1689' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:190$1078_Y [6] = $techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:189$1075_Y [6]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$476' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$497' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$513' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$529' in module `optFIR_Filter'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2009' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:190$1078_Y [6] = $techmap$auto$maccmap.cc:114:fulladd$274.$xor$<techmap.v>:189$1075_Y [6]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2185' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1077_Y [6] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2153' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$or$<techmap.v>:190$1079_Y [6] = $techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1076_Y [6]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1066' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1545' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1561' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [6] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1513' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1945' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1961' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [6] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1913' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2138' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [7] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2090' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2025' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1077_Y [6] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1993' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$274.$or$<techmap.v>:190$1079_Y [6] = $techmap$auto$maccmap.cc:114:fulladd$274.$and$<techmap.v>:189$1076_Y [6]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1785' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1801' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076_Y [6] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1753' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1705' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1077_Y [6] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1673' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$or$<techmap.v>:190$1079_Y [6] = $techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076_Y [6]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1050' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1018' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$235 [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1034' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [7] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1578' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [7] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1530' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1465' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1077_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1481' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1076_Y [6] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1433' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$or$<techmap.v>:190$1079_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1002' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$233 [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$970' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$229 [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$986' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$231 [7] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1498' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [7] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1450' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:190$1078_Y [7] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1818' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075_Y [7] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1770' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078_Y [7] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1978' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075_Y [7] = $techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076_Y [6]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1930' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078_Y [7] = $techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076_Y [6]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1385' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1077_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1401' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1076_Y [6] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1353' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$or$<techmap.v>:190$1079_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$954' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$227 [7] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1370' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:190$1078_Y [7] = $techmap$auto$maccmap.cc:114:fulladd$250.$xor$<techmap.v>:189$1075_Y [7]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1690' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:190$1078_Y [7] = $techmap$auto$maccmap.cc:114:fulladd$262.$xor$<techmap.v>:189$1075_Y [7]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$477' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$498' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$514' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$530' in module `optFIR_Filter'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2170' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:190$1078_Y [7] = $techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [7]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2250' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [7] = $techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [7]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2104' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2120' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [5] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2072' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2184' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1077_Y [5] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2152' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$or$<techmap.v>:190$1079_Y [5] = $techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1076_Y [5]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2169' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:190$1078_Y [6] = $techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [6]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2265' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [6] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2233' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [6] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [6]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2363' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [7] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [6]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2249' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [6] = $techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [6]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2264' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2280' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [5] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2232' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [5] = 1'0'.
Replacing $_NOT_ cell `$auto$simplemap.cc:37:simplemap_not$2378' (0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$not$<techmap.v>:258$1080_Y [6] = 1'1'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2362' (010) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [6] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2346' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$and$<techmap.v>:260$1082_Y [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2330' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:262$1083_Y [6] = $techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [6]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2416' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$757_Y = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2345' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$and$<techmap.v>:260$1082_Y [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2391' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$715_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2429' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$716_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2443' (00) in module `\optFIR_Filter' with constant driver `$auto$maccmap.cc:247:synth$287 [5] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2421' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$772_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2448' (00) in module `\optFIR_Filter' with constant driver `$auto$maccmap.cc:247:synth$287 [6] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2314' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:263$1084_Y [7] = $techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:262$1083_Y [7]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2313' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:263$1084_Y [6] = $techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [6]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$792' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [5] = \result [5]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1067' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1546' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1562' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [7] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1514' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1946' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077_Y [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1962' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [7] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1914' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [7] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2139' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2107' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2123' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [8] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2075' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [8] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2091' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1786' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077_Y [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1802' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076_Y [7] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1754' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079_Y [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1706' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1077_Y [7] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1674' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$262.$or$<techmap.v>:190$1079_Y [7] = $techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076_Y [7]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1051' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1019' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$235 [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1035' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [8] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1579' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [8] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1531' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1466' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1077_Y [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1482' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1076_Y [7] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1434' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$or$<techmap.v>:190$1079_Y [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1003' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$233 [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$971' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$229 [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$987' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$231 [8] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1499' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [8] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1451' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:190$1078_Y [8] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1819' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075_Y [8] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1771' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078_Y [8] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1979' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075_Y [8] = $techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076_Y [7]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1931' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078_Y [8] = $techmap$auto$maccmap.cc:114:fulladd$262.$and$<techmap.v>:189$1076_Y [7]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1386' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1077_Y [7] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1354' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$250.$or$<techmap.v>:190$1079_Y [7] = $techmap$auto$maccmap.cc:114:fulladd$250.$and$<techmap.v>:189$1076_Y [7]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$478' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$499' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$515' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$531' in module `optFIR_Filter'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2187' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1077_Y [8] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2155' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$or$<techmap.v>:190$1079_Y [8] = $techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1076_Y [8]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1068' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1547' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1563' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [8] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1515' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1947' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077_Y [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1963' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [8] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1915' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [8] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2140' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [9] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2092' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1787' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077_Y [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1803' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076_Y [8] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1755' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079_Y [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1052' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1020' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$235 [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1036' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [9] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1580' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [9] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1532' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1467' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1077_Y [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1483' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1076_Y [8] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1435' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$or$<techmap.v>:190$1079_Y [8] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1004' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$233 [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$988' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$231 [9] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1500' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [9] = $auto$rtlil.cc:1629:And$229 [9]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1452' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:190$1078_Y [9] = $auto$rtlil.cc:1629:And$229 [9]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1820' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075_Y [9] = $auto$rtlil.cc:1629:And$229 [9]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1772' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078_Y [9] = $auto$rtlil.cc:1629:And$229 [9]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1932' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078_Y [9] = $techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075_Y [9]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$479' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$500' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$516' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$532' in module `optFIR_Filter'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2172' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:190$1078_Y [9] = $techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [9]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2252' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [9] = $techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [9]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2106' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2122' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [7] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2074' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [7] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2186' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1077_Y [7] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2154' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$or$<techmap.v>:190$1079_Y [7] = $techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1076_Y [7]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2171' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:190$1078_Y [8] = $techmap$auto$maccmap.cc:114:fulladd$280.$xor$<techmap.v>:189$1075_Y [8]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2267' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [8] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2235' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [8] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [8]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2365' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [9] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [8]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2251' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [8] = $techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [8]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2266' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [7] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2234' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [7] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [7]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2364' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [8] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [7]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2401' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$745_Y = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2398' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$736_Y = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2392' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:221$718_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2430' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$719_Y = $techmap$auto$maccmap.cc:240:synth$284.$and$<techmap.v>:260$1082_Y [7]'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2436' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$or$<techmap.v>:221$737_Y = $techmap$auto$maccmap.cc:240:synth$284.$and$<techmap.v>:260$1082_Y [7]'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2439' (?0) in module `\optFIR_Filter' with constant driver `$auto$maccmap.cc:247:synth$287 [7] = $techmap$auto$maccmap.cc:240:synth$284.$and$<techmap.v>:260$1082_Y [7]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$791' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [4] = \result [4]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$794' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [7] = \result [7]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1069' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [10] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1548' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1564' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [9] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1516' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1948' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077_Y [9] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1916' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [9] = $techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [9]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2141' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [10] = $techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [9]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2109' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [10] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2125' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [10] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2077' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [10] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2093' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [10] = $techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [9]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1788' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077_Y [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1804' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076_Y [9] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1756' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079_Y [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1053' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [10] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1021' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$235 [10] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1037' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [10] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1581' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [10] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1533' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [10] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1468' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1077_Y [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1484' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1076_Y [9] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1436' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$or$<techmap.v>:190$1079_Y [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1005' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$233 [10] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1453' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:190$1078_Y [10] = $techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [10]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1821' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075_Y [10] = $techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [10]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1773' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078_Y [10] = $techmap$auto$maccmap.cc:114:fulladd$253.$xor$<techmap.v>:189$1075_Y [10]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1933' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078_Y [10] = $techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075_Y [10]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$480' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$501' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$517' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$533' in module `optFIR_Filter'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1070' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [11] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1549' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [10] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1565' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [10] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1517' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [10] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1949' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077_Y [10] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1917' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [10] = $techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [10]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2142' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [11] = $techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [10]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2094' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [11] = $techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [10]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1789' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077_Y [10] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1805' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076_Y [10] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1757' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079_Y [10] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1054' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [11] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1022' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$235 [11] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1038' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [11] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1582' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [11] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1534' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [11] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1469' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1077_Y [10] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1437' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$253.$or$<techmap.v>:190$1079_Y [10] = $techmap$auto$maccmap.cc:114:fulladd$253.$and$<techmap.v>:189$1076_Y [10]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1774' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:190$1078_Y [11] = $techmap$auto$maccmap.cc:114:fulladd$265.$xor$<techmap.v>:189$1075_Y [11]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1934' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:190$1078_Y [11] = $techmap$auto$maccmap.cc:114:fulladd$271.$xor$<techmap.v>:189$1075_Y [11]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$481' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$502' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$518' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$534' in module `optFIR_Filter'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2254' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [11] = $techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [11]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2108' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2124' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [9] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2076' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [9] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2188' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1077_Y [9] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2156' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$280.$or$<techmap.v>:190$1079_Y [9] = $techmap$auto$maccmap.cc:114:fulladd$280.$and$<techmap.v>:189$1076_Y [9]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2269' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [10] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2237' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [10] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [10]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2367' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [11] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [10]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2253' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [10] = $techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [10]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2268' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [9] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2236' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [9] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [9]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2366' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [10] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [9]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$793' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [6] = \result [6]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$796' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [9] = \result [9]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1071' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [12] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1550' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [11] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1566' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [11] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1518' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [11] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1950' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1077_Y [11] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1918' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [11] = $techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [11]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2143' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [12] = $techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [11]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2111' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [12] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2127' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [12] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2079' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [12] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2095' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [12] = $techmap$auto$maccmap.cc:114:fulladd$271.$and$<techmap.v>:189$1076_Y [11]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1790' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1077_Y [11] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1758' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$265.$or$<techmap.v>:190$1079_Y [11] = $techmap$auto$maccmap.cc:114:fulladd$265.$and$<techmap.v>:189$1076_Y [11]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1055' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [12] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1039' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$237 [12] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1583' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [12] = $auto$rtlil.cc:1629:And$235 [12]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1535' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [12] = $auto$rtlil.cc:1629:And$235 [12]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$482' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$503' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$519' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$535' in module `optFIR_Filter'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1072' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [13] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1551' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [12] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1567' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [12] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1519' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [12] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2144' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [13] = $techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [12]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2096' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [13] = $techmap$auto$maccmap.cc:114:fulladd$271.$or$<techmap.v>:190$1079_Y [12]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1056' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$239 [13] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1536' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:190$1078_Y [13] = $techmap$auto$maccmap.cc:114:fulladd$256.$xor$<techmap.v>:189$1075_Y [13]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$483' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$504' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$520' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$536' in module `optFIR_Filter'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2256' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [13] = $techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [13]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2110' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [11] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2126' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [11] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2078' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [11] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2271' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [12] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2239' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [12] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [12]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2369' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [13] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [12]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2255' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [12] = $techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [12]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2270' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [11] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2238' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [11] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [11]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2368' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [12] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [11]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$795' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [8] = \result [8]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$798' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [11] = \result [11]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1073' (const_and) in module `\optFIR_Filter' with constant driver `$auto$rtlil.cc:1629:And$241 [14] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1552' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1077_Y [13] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1520' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$256.$or$<techmap.v>:190$1079_Y [13] = $techmap$auto$maccmap.cc:114:fulladd$256.$and$<techmap.v>:189$1076_Y [13]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2113' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [14] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2081' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [14] = $techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [14]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2097' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:190$1078_Y [14] = $techmap$auto$maccmap.cc:114:fulladd$277.$xor$<techmap.v>:189$1075_Y [14]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$484' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$505' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$521' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$537' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$485' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$506' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$522' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$538' in module `optFIR_Filter'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2112' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1077_Y [13] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2128' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$and$<techmap.v>:189$1076_Y [13] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2080' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$277.$or$<techmap.v>:190$1079_Y [13] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2273' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [14] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2241' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [14] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [14]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2371' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [15] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [14]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2257' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:190$1078_Y [14] = $techmap$auto$maccmap.cc:114:fulladd$283.$xor$<techmap.v>:189$1075_Y [14]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2272' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1077_Y [13] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2240' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:114:fulladd$283.$or$<techmap.v>:190$1079_Y [13] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [13]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$2370' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$ternary$<techmap.v>:258$1081_Y [14] = $techmap$auto$maccmap.cc:114:fulladd$283.$and$<techmap.v>:189$1076_Y [13]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$797' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [10] = \result [10]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$800' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [13] = \result [13]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$636' (0?) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$xor$<techmap.v>:262$166_Y [13] = \result [13]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$799' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [12] = \result [12]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$668' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$and$<techmap.v>:260$165_Y [12] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1135' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$727_Y = 1'0'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$802' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [15] = \result [15]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$638' (0?) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$xor$<techmap.v>:262$166_Y [15] = \result [15]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$801' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$ternary$<techmap.v>:258$164_Y [14] = \result [14]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$670' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$and$<techmap.v>:260$165_Y [14] = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1134' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$730_Y = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$637' (0?) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$xor$<techmap.v>:262$166_Y [14] = \result [14]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$669' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$and$<techmap.v>:260$165_Y [13] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1167' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$728_Y = 1'0'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1130' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$742_Y = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$635' (0?) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$xor$<techmap.v>:262$166_Y [12] = \result [12]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$291' (?0) in module `\optFIR_Filter' with constant driver `$auto$simplemap.cc:250:simplemap_eqne$288 [1] = \phase [1]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$1111' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$97.$ternary$<techmap.v>:258$487_Y [1] = \phase [1]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1086' (0?) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$97.$xor$<techmap.v>:262$489_Y [1] = \phase [1]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$1110' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$97.$ternary$<techmap.v>:258$487_Y [0] = \phase [0]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1092' (1?) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$97.$and$<techmap.v>:260$488_Y [0] = \phase [0]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1148' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$97.lcu.$and$<techmap.v>:212$1102_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1145' (?0) in module `\optFIR_Filter' with constant driver `$auto$alumacc.cc:484:replace_alu$99 [0] = \phase [0]'.
Optimizing away select inverter for $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$301' in module `optFIR_Filter'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1088' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$97.$xor$<techmap.v>:263$490_Y [0] = $techmap$auto$alumacc.cc:470:replace_alu$97.$xor$<techmap.v>:262$489_Y [0]'.
Replacing $_MUX_ cell `$auto$simplemap.cc:277:simplemap_mux$1112' (??0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$97.$ternary$<techmap.v>:258$487_Y [2] = \phase [2]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1087' (0?) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$97.$xor$<techmap.v>:262$489_Y [2] = \phase [2]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1093' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$97.$and$<techmap.v>:260$488_Y [1] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1144' (0?) in module `\optFIR_Filter' with constant driver `$auto$alumacc.cc:484:replace_alu$99 [1] = $techmap$auto$alumacc.cc:470:replace_alu$97.lcu.$and$<techmap.v>:221$1104_Y'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$639' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$xor$<techmap.v>:263$167_Y [0] = $techmap$auto$alumacc.cc:470:replace_alu$94.$xor$<techmap.v>:262$166_Y [0]'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1185' (0?) in module `\optFIR_Filter' with constant driver `$auto$alumacc.cc:484:replace_alu$96 [12] = $techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$781_Y'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1179' (0?) in module `\optFIR_Filter' with constant driver `$auto$alumacc.cc:484:replace_alu$96 [13] = $techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$763_Y'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1186' (0?) in module `\optFIR_Filter' with constant driver `$auto$alumacc.cc:484:replace_alu$96 [14] = $techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:229$784_Y'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$671' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$and$<techmap.v>:260$165_Y [15] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1168' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$731_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1172' (00) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$743_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1174' (0?) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$or$<techmap.v>:221$749_Y = $techmap$auto$alumacc.cc:470:replace_alu$94.lcu.$and$<techmap.v>:221$748_Y'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$655' (0?) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$94.$xor$<techmap.v>:263$167_Y [16] = $auto$alumacc.cc:484:replace_alu$96 [15]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$1094' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$97.$and$<techmap.v>:260$488_Y [2] = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1143' (0?) in module `\optFIR_Filter' with constant driver `$auto$alumacc.cc:484:replace_alu$99 [2] = $techmap$auto$alumacc.cc:470:replace_alu$97.lcu.$and$<techmap.v>:229$1107_Y'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$1091' (0?) in module `\optFIR_Filter' with constant driver `$techmap$auto$alumacc.cc:470:replace_alu$97.$xor$<techmap.v>:263$490_Y [3] = $techmap$auto$alumacc.cc:470:replace_alu$97.lcu.$and$<techmap.v>:229$1107_Y'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2308' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:263$1084_Y [1] = $techmap$auto$maccmap.cc:114:fulladd$244.$xor$<techmap.v>:189$1075_Y [1]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2307' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:263$1084_Y [0] = $auto$rtlil.cc:1629:And$211 [0]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2309' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:263$1084_Y [2] = $techmap$auto$maccmap.cc:114:fulladd$259.$xor$<techmap.v>:189$1075_Y [2]'.
Replacing $_AND_ cell `$auto$simplemap.cc:85:simplemap_bitop$2419' (const_and) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.lcu.$and$<techmap.v>:229$766_Y = 1'0'.
Replacing $_OR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2446' (00) in module `\optFIR_Filter' with constant driver `$auto$maccmap.cc:247:synth$287 [2] = 1'0'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2310' (?0) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:263$1084_Y [3] = $techmap$auto$maccmap.cc:114:fulladd$268.$xor$<techmap.v>:189$1075_Y [3]'.
Replacing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$2323' (0?) in module `\optFIR_Filter' with constant driver `$techmap$auto$maccmap.cc:240:synth$284.$xor$<techmap.v>:263$1084_Y [16] = $auto$maccmap.cc:247:synth$287 [15]'.

yosys> opt_merge

2.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
  Cell `$auto$simplemap.cc:85:simplemap_bitop$290' is identical to cell `$auto$simplemap.cc:85:simplemap_bitop$1085'.
    Redirecting output \Y: $auto$simplemap.cc:250:simplemap_eqne$288 [0] = $techmap$auto$alumacc.cc:470:replace_alu$97.$xor$<techmap.v>:262$489_Y [0]
    Removing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$290' from module `\optFIR_Filter'.
  Cell `$auto$simplemap.cc:85:simplemap_bitop$186' is identical to cell `$auto$simplemap.cc:85:simplemap_bitop$1085'.
    Redirecting output \Y: $auto$simplemap.cc:250:simplemap_eqne$184 [0] = $techmap$auto$alumacc.cc:470:replace_alu$97.$xor$<techmap.v>:262$489_Y [0]
    Removing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$186' from module `\optFIR_Filter'.
  Cell `$auto$simplemap.cc:85:simplemap_bitop$152' is identical to cell `$auto$simplemap.cc:85:simplemap_bitop$200'.
    Redirecting output \Y: $auto$simplemap.cc:250:simplemap_eqne$149 [1] = $auto$simplemap.cc:250:simplemap_eqne$197 [1]
    Removing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$152' from module `\optFIR_Filter'.
  Cell `$auto$simplemap.cc:85:simplemap_bitop$151' is identical to cell `$auto$simplemap.cc:85:simplemap_bitop$1085'.
    Redirecting output \Y: $auto$simplemap.cc:250:simplemap_eqne$149 [0] = $techmap$auto$alumacc.cc:470:replace_alu$97.$xor$<techmap.v>:262$489_Y [0]
    Removing $_XOR_ cell `$auto$simplemap.cc:85:simplemap_bitop$151' from module `\optFIR_Filter'.
  Cell `$auto$simplemap.cc:136:simplemap_reduce$192' is identical to cell `$auto$simplemap.cc:136:simplemap_reduce$296'.
    Redirecting output \Y: $auto$simplemap.cc:127:simplemap_reduce$191 = $auto$simplemap.cc:127:simplemap_reduce$295
    Removing $_OR_ cell `$auto$simplemap.cc:136:simplemap_reduce$192' from module `\optFIR_Filter'.
Removed a total of 5 cells.

yosys> opt_rmdff

2.19.3. Executing OPT_RMDFF pass (remove dff with constant values).

yosys> opt_clean

2.19.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..
  removing unused `$_NOT_' cell `$auto$simplemap.cc:206:simplemap_lognot$196'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:206:simplemap_lognot$209'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1128'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1127'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1120'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1117'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1116'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$1115'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$1113'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:206:simplemap_lognot$300'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$804'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$803'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$805'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$806'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$807'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$808'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$809'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$810'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$811'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$812'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$813'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$814'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$815'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$816'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$817'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$818'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$819'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$1114'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1146'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1175'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1202'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1234'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1250'.
  removing unused `$_XOR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1252'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1282'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1314'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1330'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1362'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1394'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1410'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1442'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1474'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1490'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1522'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1554'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1570'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1602'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1634'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1650'.
  removing unused `$_XOR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1653'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1682'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1714'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1730'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1762'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1794'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1810'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1842'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1874'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1890'.
  removing unused `$_XOR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1894'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$1922'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1954'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$1970'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$2002'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2034'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2050'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$2082'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2114'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2130'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$2162'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2194'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2210'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$2242'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2274'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2290'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2355'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$2379'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$2380'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$2381'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$2382'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$2383'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$2384'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$2385'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$2386'.
  removing unused `$_NOT_' cell `$auto$simplemap.cc:37:simplemap_not$2387'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2396'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2400'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2402'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2403'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2404'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2405'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2406'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2410'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2411'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2413'.
  removing unused `$_AND_' cell `$auto$simplemap.cc:85:simplemap_bitop$2414'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$2434'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$2438'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$2440'.
  removing unused `$_OR_' cell `$auto$simplemap.cc:85:simplemap_bitop$2441'.

2.19.5. Finished fast OPT passes.

yosys> abc -fast

2.20. Executing ABC pass (technology mapping using ABC).

2.20.1. Extracting gate netlist of module `\optFIR_Filter' to `<abc-temp-dir>/input.blif'..
Extracted 1043 gates and 1179 wires to a netlist network with 134 inputs and 84 outputs.

2.20.1.1. Executing ABC.
Running ABC command: berkeley-abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 15 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + retime -o 
ABC: + map 
ABC: Warning: The network was strashed and balanced before mapping.
ABC: + write_blif <abc-temp-dir>/output.blif 

2.20.1.2. Re-integrating ABC results.
ABC RESULTS:               AND cells:      302
ABC RESULTS:              AOI3 cells:       68
ABC RESULTS:               MUX cells:      158
ABC RESULTS:              NAND cells:       33
ABC RESULTS:               NOR cells:       87
ABC RESULTS:               NOT cells:       76
ABC RESULTS:              OAI3 cells:       21
ABC RESULTS:                OR cells:       24
ABC RESULTS:              XNOR cells:       62
ABC RESULTS:               XOR cells:      211
ABC RESULTS:        internal signals:      961
ABC RESULTS:           input signals:      134
ABC RESULTS:          output signals:       84
Removing temp directory.

yosys> opt -fast

2.21. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

2.21.1. Executing OPT_EXPR pass (perform const folding).
Optimizing away select inverter for $_MUX_ cell `$abc$2453$auto$blifparse.cc:286:parse_blif$2470' in module `optFIR_Filter'.
Optimizing away select inverter for $_MUX_ cell `$abc$2453$auto$blifparse.cc:286:parse_blif$2466' in module `optFIR_Filter'.

yosys> opt_merge

2.21.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
Removed a total of 0 cells.

yosys> opt_rmdff

2.21.3. Executing OPT_RMDFF pass (remove dff with constant values).

yosys> opt_clean

2.21.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..
  removing unused non-port wire \coeff.
  removing unused non-port wire \samplevalue.
  removed 2 unused temporary wires.

2.21.5. Finished fast OPT passes.

yosys> hierarchy -check

2.22. Executing HIERARCHY pass (managing design hierarchy).

2.22.1. Analyzing design hierarchy..
Top module:  \optFIR_Filter

2.22.2. Analyzing design hierarchy..
Top module:  \optFIR_Filter
Removed 0 unused modules.

yosys> stat

2.23. Printing statistics.

=== optFIR_Filter ===

   Number of wires:                979
   Number of wire bits:           1193
   Number of public wires:          14
   Number of public wire bits:     151
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1126
     $_AND_                        302
     $_AOI3_                        68
     $_DFF_P_                       84
     $_MUX_                        158
     $_NAND_                        33
     $_NOR_                         87
     $_NOT_                         76
     $_OAI3_                        21
     $_OR_                          24
     $_XNOR_                        62
     $_XOR_                        211


yosys> check

2.24. Executing CHECK pass (checking for obvious problems).
checking module optFIR_Filter..
found and reported 0 problems.

yosys> opt

3. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.1. Executing OPT_EXPR pass (perform const folding).

yosys> opt_merge -nomux

3.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \optFIR_Filter..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \optFIR_Filter.
Performed a total of 0 changes.

yosys> opt_merge

3.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\optFIR_Filter'.
Removed a total of 0 cells.

yosys> opt_rmdff

3.6. Executing OPT_RMDFF pass (remove dff with constant values).

yosys> opt_clean

3.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..

yosys> opt_expr

3.8. Executing OPT_EXPR pass (perform const folding).

3.9. Finished OPT passes. (There is nothing left to do.)

yosys> opt_clean -purge

4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \optFIR_Filter..
  removing unused non-port wire \Yt.
  removed 1 unused temporary wires.

yosys> dfflibmap -liberty /home/icarosix/asictoolchain/OpenLane/pdks/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib

5. Executing DFFLIBMAP pass (mapping DFF cells to sequential cells from liberty file).
  cell sky130_fd_sc_hd__dfxtp_1 (noninv, pins=3, area=20.02) is a direct match for cell type $_DFF_P_.
  cell sky130_fd_sc_hd__dfrtn_1 (noninv, pins=4, area=25.02) is a direct match for cell type $_DFF_NN0_.
  cell sky130_fd_sc_hd__dfrtp_1 (noninv, pins=4, area=25.02) is a direct match for cell type $_DFF_PN0_.
  cell sky130_fd_sc_hd__dfstp_2 (noninv, pins=4, area=26.28) is a direct match for cell type $_DFF_PN1_.
  cell sky130_fd_sc_hd__dfbbn_1 (noninv, pins=6, area=32.53) is a direct match for cell type $_DFFSR_NNN_.
  cell sky130_fd_sc_hd__dfbbp_1 (noninv, pins=6, area=32.53) is a direct match for cell type $_DFFSR_PNN_.
  create mapping for $_DFF_NP0_ from mapping for $_DFF_NN0_.
  create mapping for $_DFF_PP0_ from mapping for $_DFF_PN0_.
  create mapping for $_DFF_PP1_ from mapping for $_DFF_PN1_.
  create mapping for $_DFFSR_NPN_ from mapping for $_DFFSR_NNN_.
  create mapping for $_DFFSR_PPN_ from mapping for $_DFFSR_PNN_.
  create mapping for $_DFFSR_NNP_ from mapping for $_DFFSR_NNN_.
  create mapping for $_DFFSR_NPP_ from mapping for $_DFFSR_NNP_.
  create mapping for $_DFFSR_PNP_ from mapping for $_DFFSR_PNN_.
  create mapping for $_DFFSR_PPP_ from mapping for $_DFFSR_PNP_.
  create mapping for $_DFF_NN1_ from mapping for $_DFF_NN0_.
  create mapping for $_DFF_NP1_ from mapping for $_DFF_NN1_.
  create mapping for $_DFF_N_ from mapping for $_DFF_P_.
  final dff cell mappings:
    sky130_fd_sc_hd__dfxtp_1 _DFF_N_ (.CLK(~C), .D( D), .Q( Q));
    sky130_fd_sc_hd__dfxtp_1 _DFF_P_ (.CLK( C), .D( D), .Q( Q));
    sky130_fd_sc_hd__dfrtn_1 _DFF_NN0_ (.CLK_N( C), .D( D), .Q( Q), .RESET_B( R));
    sky130_fd_sc_hd__dfrtn_1 _DFF_NN1_ (.CLK_N( C), .D(~D), .Q(~Q), .RESET_B( R));
    sky130_fd_sc_hd__dfrtn_1 _DFF_NP0_ (.CLK_N( C), .D( D), .Q( Q), .RESET_B(~R));
    sky130_fd_sc_hd__dfrtn_1 _DFF_NP1_ (.CLK_N( C), .D(~D), .Q(~Q), .RESET_B(~R));
    sky130_fd_sc_hd__dfrtp_1 _DFF_PN0_ (.CLK( C), .D( D), .Q( Q), .RESET_B( R));
    sky130_fd_sc_hd__dfstp_2 _DFF_PN1_ (.CLK( C), .D( D), .Q( Q), .SET_B( R));
    sky130_fd_sc_hd__dfrtp_1 _DFF_PP0_ (.CLK( C), .D( D), .Q( Q), .RESET_B(~R));
    sky130_fd_sc_hd__dfstp_2 _DFF_PP1_ (.CLK( C), .D( D), .Q( Q), .SET_B(~R));
    sky130_fd_sc_hd__dfbbn_1 _DFFSR_NNN_ (.CLK_N( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B( R), .SET_B( S));
    sky130_fd_sc_hd__dfbbn_1 _DFFSR_NNP_ (.CLK_N( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B(~R), .SET_B( S));
    sky130_fd_sc_hd__dfbbn_1 _DFFSR_NPN_ (.CLK_N( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B( R), .SET_B(~S));
    sky130_fd_sc_hd__dfbbn_1 _DFFSR_NPP_ (.CLK_N( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B(~R), .SET_B(~S));
    sky130_fd_sc_hd__dfbbp_1 _DFFSR_PNN_ (.CLK( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B( R), .SET_B( S));
    sky130_fd_sc_hd__dfbbp_1 _DFFSR_PNP_ (.CLK( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B(~R), .SET_B( S));
    sky130_fd_sc_hd__dfbbp_1 _DFFSR_PPN_ (.CLK( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B( R), .SET_B(~S));
    sky130_fd_sc_hd__dfbbp_1 _DFFSR_PPP_ (.CLK( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B(~R), .SET_B(~S));
Mapping DFF cells in module `\optFIR_Filter':
  mapped 84 $_DFF_P_ cells to \sky130_fd_sc_hd__dfxtp_1 cells.

yosys> abc -liberty /home/icarosix/asictoolchain/OpenLane/pdks/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib

6. Executing ABC pass (technology mapping using ABC).

6.1. Extracting gate netlist of module `\optFIR_Filter' to `<abc-temp-dir>/input.blif'..
Extracted 1042 gates and 1176 wires to a netlist network with 134 inputs and 84 outputs.

6.1.1. Executing ABC.
Running ABC command: berkeley-abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_lib -w /home/icarosix/asictoolchain/OpenLane/pdks/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib 
ABC: Parsing finished successfully.  Parsing time =     0.08 sec
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_12" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_3" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_6" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_8" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__diode_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_8".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_0".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_8".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_8".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_bleeder_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_12" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_3" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_6" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_8" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__lpflow_inputisolatch_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_4".
ABC: Library "sky130_fd_sc_hd__tt_025C_1v80" from "/home/icarosix/asictoolchain/OpenLane/pdks/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib" has 334 cells (94 skipped: 63 seq; 13 tri-state; 18 no func).  Time =     0.13 sec
ABC: Memory =   16.04 MB. Time =     0.13 sec
ABC: Warning: Detected 9 multi-output gates (for example, "sky130_fd_sc_hd__fa_1").
ABC: + strash 
ABC: + dc2 
ABC: + scorr 
ABC: Warning: The network is combinational (run "fraig" or "fraig_sweep").
ABC: + ifraig 
ABC: + retime -o 
ABC: + strash 
ABC: + dch -f 
ABC: + map 
ABC: + write_blif <abc-temp-dir>/output.blif 

6.1.2. Re-integrating ABC results.
ABC RESULTS:   sky130_fd_sc_hd__a211oi_1 cells:       22
ABC RESULTS:   sky130_fd_sc_hd__a21boi_0 cells:       18
ABC RESULTS:   sky130_fd_sc_hd__a21o_2 cells:        9
ABC RESULTS:   sky130_fd_sc_hd__a21oi_1 cells:      135
ABC RESULTS:   sky130_fd_sc_hd__a221oi_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__a22o_2 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__a22oi_1 cells:       17
ABC RESULTS:   sky130_fd_sc_hd__a31oi_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__a32oi_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__and2_2 cells:        6
ABC RESULTS:   sky130_fd_sc_hd__and2b_2 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__and3_2 cells:       20
ABC RESULTS:   sky130_fd_sc_hd__clkinv_1 cells:      112
ABC RESULTS:   sky130_fd_sc_hd__lpflow_inputiso0p_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__maj3_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__mux2i_1 cells:       21
ABC RESULTS:   sky130_fd_sc_hd__nand2_1 cells:      301
ABC RESULTS:   sky130_fd_sc_hd__nand3_1 cells:      177
ABC RESULTS:   sky130_fd_sc_hd__nand3b_1 cells:       16
ABC RESULTS:   sky130_fd_sc_hd__nand4_1 cells:       56
ABC RESULTS:   sky130_fd_sc_hd__nor2_1 cells:      154
ABC RESULTS:   sky130_fd_sc_hd__nor3_1 cells:       28
ABC RESULTS:   sky130_fd_sc_hd__nor3b_1 cells:        8
ABC RESULTS:   sky130_fd_sc_hd__nor4_1 cells:        4
ABC RESULTS:   sky130_fd_sc_hd__o2111a_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__o2111ai_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__o211a_1 cells:        6
ABC RESULTS:   sky130_fd_sc_hd__o211ai_1 cells:        6
ABC RESULTS:   sky130_fd_sc_hd__o21a_1 cells:        6
ABC RESULTS:   sky130_fd_sc_hd__o21ai_0 cells:      129
ABC RESULTS:   sky130_fd_sc_hd__o21bai_1 cells:       22
ABC RESULTS:   sky130_fd_sc_hd__o221ai_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__o22ai_1 cells:       29
ABC RESULTS:   sky130_fd_sc_hd__o2bb2ai_1 cells:       24
ABC RESULTS:   sky130_fd_sc_hd__o31ai_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__or2_2 cells:        5
ABC RESULTS:   sky130_fd_sc_hd__xnor2_1 cells:       18
ABC RESULTS:   sky130_fd_sc_hd__xnor3_4 cells:       15
ABC RESULTS:   sky130_fd_sc_hd__xor2_1 cells:       23
ABC RESULTS:   sky130_fd_sc_hd__xor3_4 cells:        5
ABC RESULTS:        internal signals:      958
ABC RESULTS:           input signals:      134
ABC RESULTS:          output signals:       84
Removing temp directory.

yosys> insbuf -buf sky130_fd_sc_hd__buf_2 A X

7. Executing INSBUF pass (insert buffer cells for connected wires).
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4910: \cycle_valid -> $abc$3496$n0
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4911: \phase [1] -> $abc$3496$n2
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4912: \phase [0] -> $abc$3496$n4
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4913: \phase [2] -> $abc$3496$n6
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4914: \rst -> $abc$3496$n10
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4915: $abc$3496$n11 -> $0\cycle_valid[0:0]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4916: $abc$3496$n14 -> $0\phase[2:0] [0]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4917: $abc$3496$n18 -> $0\phase[2:0] [1]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4918: $abc$3496$n22 -> $0\phase[2:0] [2]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4919: \result [0] -> $abc$3496$n23
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4920: \X3 [4] -> $abc$3496$n31
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4921: \X2 [4] -> $abc$3496$n33
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4922: \X1 [4] -> $abc$3496$n35
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4923: \X [4] -> $abc$3496$n37
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4924: \b0 [0] -> $abc$3496$n40
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4925: \b1 [0] -> $abc$3496$n41
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4926: \X [3] -> $abc$3496$n44
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4927: \X1 [3] -> $abc$3496$n46
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4928: \X2 [3] -> $abc$3496$n48
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4929: \X3 [3] -> $abc$3496$n50
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4930: \b0 [1] -> $abc$3496$n55
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4931: \b1 [1] -> $abc$3496$n56
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4932: \X [2] -> $abc$3496$n60
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4933: \X1 [2] -> $abc$3496$n62
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4934: \X2 [2] -> $abc$3496$n64
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4935: \X3 [2] -> $abc$3496$n66
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4936: \b0 [2] -> $abc$3496$n71
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4937: \b1 [2] -> $abc$3496$n72
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4938: \X3 [1] -> $abc$3496$n79
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4939: \X2 [1] -> $abc$3496$n81
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4940: \X1 [1] -> $abc$3496$n83
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4941: \X [1] -> $abc$3496$n85
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4942: \b0 [3] -> $abc$3496$n91
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4943: \b1 [3] -> $abc$3496$n92
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4944: \X3 [0] -> $abc$3496$n95
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4945: \X2 [0] -> $abc$3496$n97
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4946: \X1 [0] -> $abc$3496$n99
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4947: \X [0] -> $abc$3496$n101
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4948: \b0 [4] -> $abc$3496$n103
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4949: \b1 [4] -> $abc$3496$n104
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4950: $abc$3496$n131 -> $0\result[15:0] [0]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4951: \result [1] -> $abc$3496$n132
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4952: \X3 [5] -> $abc$3496$n134
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4953: \X2 [5] -> $abc$3496$n136
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4954: \X1 [5] -> $abc$3496$n138
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4955: \X [5] -> $abc$3496$n140
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4956: \b0 [5] -> $abc$3496$n153
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4957: \b1 [5] -> $abc$3496$n154
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4958: $abc$3496$n174 -> $0\result[15:0] [1]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4959: \X [6] -> $abc$3496$n175
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4960: \X1 [6] -> $abc$3496$n177
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4961: \X2 [6] -> $abc$3496$n179
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4962: \X3 [6] -> $abc$3496$n181
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4963: \b0 [6] -> $abc$3496$n206
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4964: \b1 [6] -> $abc$3496$n207
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4965: \result [2] -> $abc$3496$n220
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4966: $abc$3496$n226 -> $0\result[15:0] [2]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4967: \result [3] -> $abc$3496$n227
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4968: \X3 [7] -> $abc$3496$n229
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4969: \X2 [7] -> $abc$3496$n231
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4970: \X1 [7] -> $abc$3496$n233
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4971: \X [7] -> $abc$3496$n235
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4972: \b0 [7] -> $abc$3496$n258
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4973: \b1 [7] -> $abc$3496$n259
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4974: $abc$3496$n284 -> $0\result[15:0] [3]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4975: \X3 [8] -> $abc$3496$n285
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4976: \X2 [8] -> $abc$3496$n287
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4977: \X1 [8] -> $abc$3496$n289
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4978: \X [8] -> $abc$3496$n291
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4979: \b0 [8] -> $abc$3496$n316
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4980: \b1 [8] -> $abc$3496$n317
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4981: \result [4] -> $abc$3496$n339
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4982: $abc$3496$n348 -> $0\result[15:0] [4]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4983: \result [5] -> $abc$3496$n349
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4984: \X [9] -> $abc$3496$n351
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4985: \X1 [9] -> $abc$3496$n353
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4986: \X2 [9] -> $abc$3496$n355
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4987: \X3 [9] -> $abc$3496$n357
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4988: \b0 [9] -> $abc$3496$n402
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4989: \b1 [9] -> $abc$3496$n403
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4990: $abc$3496$n425 -> $0\result[15:0] [5]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4991: \X3 [10] -> $abc$3496$n426
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4992: \X2 [10] -> $abc$3496$n428
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4993: \X1 [10] -> $abc$3496$n430
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4994: \X [10] -> $abc$3496$n432
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4995: \b0 [10] -> $abc$3496$n472
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4996: \b1 [10] -> $abc$3496$n473
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4997: \result [6] -> $abc$3496$n494
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4998: $abc$3496$n504 -> $0\result[15:0] [6]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$4999: \result [7] -> $abc$3496$n505
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5000: \X3 [11] -> $abc$3496$n507
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5001: \X2 [11] -> $abc$3496$n509
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5002: \X1 [11] -> $abc$3496$n511
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5003: \X [11] -> $abc$3496$n513
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5004: \b0 [11] -> $abc$3496$n555
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5005: \b1 [11] -> $abc$3496$n556
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5006: $abc$3496$n585 -> $0\result[15:0] [7]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5007: \result [8] -> $abc$3496$n586
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5008: \X [12] -> $abc$3496$n588
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5009: \X1 [12] -> $abc$3496$n590
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5010: \X2 [12] -> $abc$3496$n592
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5011: \X3 [12] -> $abc$3496$n594
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5012: \b1 [12] -> $abc$3496$n649
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5013: \b0 [12] -> $abc$3496$n651
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5014: $abc$3496$n690 -> $0\result[15:0] [8]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5015: \result [9] -> $abc$3496$n691
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5016: \X3 [13] -> $abc$3496$n693
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5017: \X2 [13] -> $abc$3496$n695
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5018: \X1 [13] -> $abc$3496$n697
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5019: \X [13] -> $abc$3496$n699
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5020: \b0 [13] -> $abc$3496$n754
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5021: \b1 [13] -> $abc$3496$n755
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5022: $abc$3496$n788 -> $0\result[15:0] [9]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5023: \result [10] -> $abc$3496$n789
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5024: \X3 [14] -> $abc$3496$n791
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5025: \X2 [14] -> $abc$3496$n793
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5026: \X1 [14] -> $abc$3496$n795
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5027: \X [14] -> $abc$3496$n797
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5028: \b0 [14] -> $abc$3496$n856
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5029: \b1 [14] -> $abc$3496$n857
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5030: $abc$3496$n898 -> $0\result[15:0] [10]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5031: \X [15] -> $abc$3496$n900
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5032: \X1 [15] -> $abc$3496$n902
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5033: \X2 [15] -> $abc$3496$n904
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5034: \X3 [15] -> $abc$3496$n906
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5035: \b0 [15] -> $abc$3496$n977
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5036: \b1 [15] -> $abc$3496$n978
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5037: \result [11] -> $abc$3496$n993
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5038: $abc$3496$n1000 -> $0\result[15:0] [11]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5039: \result [12] -> $abc$3496$n1011
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5040: $abc$3496$n1014 -> $0\result[15:0] [12]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5041: \result [13] -> $abc$3496$n1016
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5042: $abc$3496$n1019 -> $0\result[15:0] [13]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5043: \result [14] -> $abc$3496$n1022
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5044: $abc$3496$n1025 -> $0\result[15:0] [14]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5045: \result [15] -> $abc$3496$n1027
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5046: $abc$3496$n1030 -> $0\result[15:0] [15]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5047: \Y [0] -> $abc$3496$n1031
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5048: \en -> $abc$3496$n1032
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5049: $abc$3496$n1034 -> $0\Yt[15:0] [0]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5050: \Y [1] -> $abc$3496$n1035
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5051: $abc$3496$n1037 -> $0\Yt[15:0] [1]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5052: \Y [2] -> $abc$3496$n1038
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5053: $abc$3496$n1040 -> $0\Yt[15:0] [2]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5054: \Y [3] -> $abc$3496$n1041
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5055: $abc$3496$n1043 -> $0\Yt[15:0] [3]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5056: \Y [4] -> $abc$3496$n1044
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5057: $abc$3496$n1046 -> $0\Yt[15:0] [4]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5058: \Y [5] -> $abc$3496$n1047
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5059: $abc$3496$n1049 -> $0\Yt[15:0] [5]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5060: \Y [6] -> $abc$3496$n1050
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5061: $abc$3496$n1052 -> $0\Yt[15:0] [6]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5062: \Y [7] -> $abc$3496$n1053
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5063: $abc$3496$n1055 -> $0\Yt[15:0] [7]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5064: \Y [8] -> $abc$3496$n1056
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5065: $abc$3496$n1058 -> $0\Yt[15:0] [8]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5066: \Y [9] -> $abc$3496$n1059
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5067: $abc$3496$n1061 -> $0\Yt[15:0] [9]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5068: \Y [10] -> $abc$3496$n1062
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5069: $abc$3496$n1064 -> $0\Yt[15:0] [10]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5070: \Y [11] -> $abc$3496$n1065
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5071: $abc$3496$n1067 -> $0\Yt[15:0] [11]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5072: \Y [12] -> $abc$3496$n1068
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5073: $abc$3496$n1070 -> $0\Yt[15:0] [12]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5074: \Y [13] -> $abc$3496$n1071
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5075: $abc$3496$n1073 -> $0\Yt[15:0] [13]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5076: \Y [14] -> $abc$3496$n1074
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5077: $abc$3496$n1076 -> $0\Yt[15:0] [14]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5078: \Y [15] -> $abc$3496$n1077
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5079: $abc$3496$n1079 -> $0\Yt[15:0] [15]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5080: $abc$3496$n1081 -> $0\X3[15:0] [0]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5081: $abc$3496$n1083 -> $0\X3[15:0] [1]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5082: $abc$3496$n1085 -> $0\X3[15:0] [2]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5083: $abc$3496$n1087 -> $0\X3[15:0] [3]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5084: $abc$3496$n1089 -> $0\X3[15:0] [4]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5085: $abc$3496$n1091 -> $0\X3[15:0] [5]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5086: $abc$3496$n1093 -> $0\X3[15:0] [6]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5087: $abc$3496$n1095 -> $0\X3[15:0] [7]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5088: $abc$3496$n1097 -> $0\X3[15:0] [8]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5089: $abc$3496$n1099 -> $0\X3[15:0] [9]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5090: $abc$3496$n1101 -> $0\X3[15:0] [10]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5091: $abc$3496$n1103 -> $0\X3[15:0] [11]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5092: $abc$3496$n1105 -> $0\X3[15:0] [12]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5093: $abc$3496$n1107 -> $0\X3[15:0] [13]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5094: $abc$3496$n1109 -> $0\X3[15:0] [14]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5095: $abc$3496$n1111 -> $0\X3[15:0] [15]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5096: $abc$3496$n1113 -> $0\X2[15:0] [0]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5097: $abc$3496$n1115 -> $0\X2[15:0] [1]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5098: $abc$3496$n1117 -> $0\X2[15:0] [2]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5099: $abc$3496$n1119 -> $0\X2[15:0] [3]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5100: $abc$3496$n1121 -> $0\X2[15:0] [4]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5101: $abc$3496$n1123 -> $0\X2[15:0] [5]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5102: $abc$3496$n1125 -> $0\X2[15:0] [6]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5103: $abc$3496$n1127 -> $0\X2[15:0] [7]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5104: $abc$3496$n1129 -> $0\X2[15:0] [8]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5105: $abc$3496$n1131 -> $0\X2[15:0] [9]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5106: $abc$3496$n1133 -> $0\X2[15:0] [10]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5107: $abc$3496$n1135 -> $0\X2[15:0] [11]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5108: $abc$3496$n1137 -> $0\X2[15:0] [12]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5109: $abc$3496$n1139 -> $0\X2[15:0] [13]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5110: $abc$3496$n1141 -> $0\X2[15:0] [14]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5111: $abc$3496$n1143 -> $0\X2[15:0] [15]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5112: $abc$3496$n1145 -> $0\X1[15:0] [0]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5113: $abc$3496$n1147 -> $0\X1[15:0] [1]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5114: $abc$3496$n1149 -> $0\X1[15:0] [2]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5115: $abc$3496$n1151 -> $0\X1[15:0] [3]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5116: $abc$3496$n1153 -> $0\X1[15:0] [4]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5117: $abc$3496$n1155 -> $0\X1[15:0] [5]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5118: $abc$3496$n1157 -> $0\X1[15:0] [6]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5119: $abc$3496$n1159 -> $0\X1[15:0] [7]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5120: $abc$3496$n1161 -> $0\X1[15:0] [8]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5121: $abc$3496$n1163 -> $0\X1[15:0] [9]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5122: $abc$3496$n1165 -> $0\X1[15:0] [10]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5123: $abc$3496$n1167 -> $0\X1[15:0] [11]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5124: $abc$3496$n1169 -> $0\X1[15:0] [12]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5125: $abc$3496$n1171 -> $0\X1[15:0] [13]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5126: $abc$3496$n1173 -> $0\X1[15:0] [14]
Added optFIR_Filter.$auto$insbuf.cc:79:execute$5127: $abc$3496$n1175 -> $0\X1[15:0] [15]

yosys> stat

8. Printing statistics.

=== optFIR_Filter ===

   Number of wires:               2525
   Number of wire bits:           2724
   Number of public wires:          13
   Number of public wire bits:     135
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1715
     sky130_fd_sc_hd__a211oi_1      22
     sky130_fd_sc_hd__a21boi_0      18
     sky130_fd_sc_hd__a21o_2         9
     sky130_fd_sc_hd__a21oi_1      135
     sky130_fd_sc_hd__a221oi_1       1
     sky130_fd_sc_hd__a22o_2         1
     sky130_fd_sc_hd__a22oi_1       17
     sky130_fd_sc_hd__a31oi_1        3
     sky130_fd_sc_hd__a32oi_1        1
     sky130_fd_sc_hd__and2_2         6
     sky130_fd_sc_hd__and2b_2        2
     sky130_fd_sc_hd__and3_2        20
     sky130_fd_sc_hd__buf_2        218
     sky130_fd_sc_hd__clkinv_1     112
     sky130_fd_sc_hd__dfxtp_1       84
     sky130_fd_sc_hd__lpflow_inputiso0p_1      2
     sky130_fd_sc_hd__maj3_1         2
     sky130_fd_sc_hd__mux2i_1       21
     sky130_fd_sc_hd__nand2_1      301
     sky130_fd_sc_hd__nand3_1      177
     sky130_fd_sc_hd__nand3b_1      16
     sky130_fd_sc_hd__nand4_1       56
     sky130_fd_sc_hd__nor2_1       154
     sky130_fd_sc_hd__nor3_1        28
     sky130_fd_sc_hd__nor3b_1        8
     sky130_fd_sc_hd__nor4_1         4
     sky130_fd_sc_hd__o2111a_1       3
     sky130_fd_sc_hd__o2111ai_1      3
     sky130_fd_sc_hd__o211a_1        6
     sky130_fd_sc_hd__o211ai_1       6
     sky130_fd_sc_hd__o21a_1         6
     sky130_fd_sc_hd__o21ai_0      129
     sky130_fd_sc_hd__o21bai_1      22
     sky130_fd_sc_hd__o221ai_1       1
     sky130_fd_sc_hd__o22ai_1       29
     sky130_fd_sc_hd__o2bb2ai_1     24
     sky130_fd_sc_hd__o31ai_1        2
     sky130_fd_sc_hd__or2_2          5
     sky130_fd_sc_hd__xnor2_1       18
     sky130_fd_sc_hd__xnor3_4       15
     sky130_fd_sc_hd__xor2_1        23
     sky130_fd_sc_hd__xor3_4         5


yosys> write_verilog ./results/optFIR_Filter.synth.v

9. Executing Verilog backend.
Dumping module `\optFIR_Filter'.

End of script. Logfile hash: 749b60a852
CPU: user 0.58s system 0.03s, MEM: 197.41 MB total, 39.67 MB resident
Yosys 0.7 (git sha1 61f6811, gcc 6.2.0-11ubuntu1 -O2 -fdebug-prefix-map=/build/yosys-OIL3SR/yosys-0.7=. -fstack-protector-strong -fPIC -Os)
Time spent: 25% 1x dfflibmap (0 sec), 13% 16x opt_expr (0 sec), ...
